ftw/httpd/endpoint.org
#+TITLE: Endpoints: For The Web!
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)

A way to define and dispatch on endpoints: For The Web!

#+begin_src gerbil
  (import :drewc/ftw/httpd/endpoint) 
  (import :drewc/ftw/httpd/handler) 
  (import :std/test :std/net/httpd :std/net/request)
#+end_src

* Overview 

Essentially, endpoints a no nonsense declarative way to define functions for URLs, and a
~mux~ that takes care of them.

First things first, imports to just use endpoints. In reality we'll likely just
import [[file:~/src/ftw/src/ftw.org][the ftw module]] itself, but for testing as well as this overview, we'll
import things as needed.

#+begin_src gerbil 
  (import :drewc/ftw/httpd/endpoint) 
#+end_src

The endpoint module exports ~define-endpoint~ which is syntax to, well, define
an endpoint.

#+begin_src gerbil
  (define-endpoint overview "^/([^-]*)-?overview/?(.*)")
#+end_src

What it does by default is define an endpoint so that, when a request comes it,
the pregexp is attempted. If it matches, any regexp groups are passed as
arguments to the function it calls.

There are keyword arguments available for ~define-endpoint~

   - ~priority:~ :: The [[#overview_priority][priority whereby the queue tries the match and hander.]]


** Identify Handler Function

 The functions it may call are based on the name, in this case ~test~, and the
 method the server uses to get the page. So, to start with, ~test/GET~.

 #+begin_src gerbil 
   (import :drewc/ftw/httpd/handler) 
 #+end_src

 #+begin_src gerbil  
   (def (overview/GET prefix postfix)
     (http-response-write* 200 [] (string-append prefix " ov " postfix)))
 #+end_src

 Wait, ~http-response-write*~? What is that? [[file:handler.org][~:drewc/ftw/httpd/handler~]] exports
 ~current-http-request~ and ~current-http-response~. That allows our functions to
 be under a request-response cycle without specific names unless needed.

** Endpoint Mux

 An ~http-server~ requires a ~mux~ in order to dispatch and handle requests and
 ~:drewc/ftw/httpd/endpoint~ exports [[*Endpoint][~default-endpoint-http-mux~]] which as the
 name implies is used by default.

** Test http request and server

   Define some precursors. Check out Gerbil's [[https://cons.io/tutorials/httpd.html][httpd tutorial]] for what they are.

 #+begin_src gerbil :noweb-ref test-http-request
   (import :std/test :std/net/httpd :std/net/request)

   (def server-address "127.0.0.1:9942")

   (def server-url (string-append "http://" server-address)) 

   (def (test-http-get url) (http-get (string-append server-url url))) 

   (def httpd #f) 

   (defrules with-httpd []
     ((_ mux body ...)
      (with-unwind-protect
       (lambda ()
         (when httpd 
           (stop-http-server! httpd))
         (set! httpd (start-http-server! server-address mux: mux))
         body ...)
       (lambda () (stop-http-server! httpd)))))
 #+end_src

** The first test.

   Up until this point we've only defined things. Now time to use them.

   #+begin_src gerbil :noweb-ref overview-test
     (with-httpd
      default-endpoint-http-mux
      (let (r (test-http-get "/first-overview"))
        (check (request-status r) => 200)
        (check (request-text r) => "first ov "))
      (let (r (test-http-get "/first-overview/test"))
        (check (request-status r) => 200)
        (check (request-text r) => "first ov test")))
   #+end_src

** 404 aka default handler 

   What happens if there is no endpoint that matches? A 404 error is returned.

   #+begin_src gerbil :noweb-ref overview-test
     (with-httpd
      default-endpoint-http-mux
      (let (r (test-http-get "/nope"))
        (check (request-status r) => 404)
        (check (request-text r) => "these aren't the droids you are looking for")))
   #+end_src

   We can set it to something different, as the mux has ~endpoint-http-mux-404-handler~  

#+begin_src gerbil
  (with-httpd
   default-endpoint-http-mux
   (let* ((mux default-endpoint-http-mux)
          (prev (endpoint-http-mux-404-handler mux)))
     ;; set! to a new 404 handler
     (set! (endpoint-http-mux-404-handler mux)
       (lambda (req res)
         (http-response-write
          res 404 '(("Content-Type" . "text/plain"))
          (string-append "Not Found: " (http-request-path req)))))
     (with-unwind-protect
      (lambda ()
        ;; does it work? 
        (let (r (test-http-get "/nope"))
          (check (request-text r) => "Not Found: /nope")))
      ;; reset the handler
      (cut set! (endpoint-http-mux-404-handler mux) prev))))
#+end_src

** ~priority:~, and a default in queue! 
   :PROPERTIES:
   :CUSTOM_ID: overview_priority
   :END:

   Because by default an endpoint matches a regexp there could be many regexps
   that match the same request, a ~priority:~ argument is provided.

   For example, say we want an endpoint that matches "/overview" specifically.
   While our existing one does match it in general, this is a more specific
   case. By default, the priority of all endpoints is ~42~.

   #+begin_src gerbil 
     (check (endpoint-queue-default-priority
             (endpoint-http-mux-queue default-endpoint-http-mux))
            => 42)
   #+end_src

   The priority is how the endpoints are first sorted. By setting an endpoint
   with a *lower* priority, it is run first.

#+begin_src gerbil
  (define-endpoint specific-overview "^/overview$"
   priority: 1)
  (def (specific-overview/GET) 
    (http-response-write* 200 [] "Specific overview!"))
#+end_src

#+begin_src gerbil
  (with-httpd
   default-endpoint-http-mux
   (let (r (test-http-get "/overview"))
     (check (request-status r) => 200)
     (check (request-text r) => "Specific overview!"))
   (let (s (test-http-get "/overview/"))
     (check (request-status s) => 200)
     (check (request-text s) => " ov "))

   ;; and turn it around.
   (add-endpoint-to-mux!
    specific-overview::endpoint default-endpoint-http-mux
    priority: 43)
   (let (t (test-http-get "/overview"))
     (check (request-status t) => 200)
     (check (request-text t) => " ov "))

   ;; and back
   (add-endpoint-to-mux!
    specific-overview::endpoint default-endpoint-http-mux
    priority: 1))
#+end_src

** ~endpoint-match-predicate~, not everything is a regexp!

   By default, when a string is the second argument it's a regexp, and the
   handler is passed, as arguments, the list returned as groups by the regexp.

   If it's a procedure, that's run with the request as the args.

   #+begin_src gerbil
     (def (is-42? req (path (http-request-path req)))
       (and (equal? path "/42") []))
     (def (is-42/GET)
       (http-response-write*
        200 [] "The Answer to Life, the Universe, and Everything"))
     (define-endpoint is-42 is-42?)
   #+end_src

   #+begin_src gerbil
     (with-httpd
      default-endpoint-http-mux
      (let (r (test-http-get "/42"))
        (check (request-text r)
               => "The Answer to Life, the Universe, and Everything")))
   #+end_src
   
   
* Endpoint
  :PROPERTIES:
  :header-args: :noweb-ref endpoints-code
  :END:

For simple toplevel declarations, a toplevel default [[#endpoint_mux][Endpoint Mux]] is nice to have.

#+begin_src gerbil
  (def default-endpoint-http-mux (endpoint-http-mux))
#+end_src

When defining an endpoint they'll be identified as ~name::endpoint~. The args
that are accepted wrap it up.

  - ~mux:~ :: the mux this endpoint will be added to.  

#+begin_src gerbil 
  (defsyntax (define-endpoint stx)
    (syntax-case stx ()
      ((macro name match args ...)
       (let* ((props (syntax->datum #'(args ...)))
              (name (syntax->datum #'name))
              (m (syntax->datum #'match))
              (mux (or (pget mux: props)
                       'drewc/ftw/httpd/endpoint#default-endpoint-http-mux))
              (p (pget priority: props))
              (h (pget handler: props))
              (endpoint `(drewc/ftw/httpd/endpoint/struct#make-endpoint
                          ',name ,m ,@(if h [handler: h] [])))
              (defname (string->symbol
                        (string-append (symbol->string name) "::endpoint")))
              (form
               `(begin (def ,defname ,endpoint)
                       (drewc/ftw/httpd/endpoint/mux#add-endpoint-to-mux!
                        ,defname ,mux ,@(if p [priority: p] []))
                       ,defname)))
         (datum->syntax #'macro form)))))
#+end_src




#+begin_src gerbil :noweb-ref test-endpoint
  (import :std/format)
  (define-endpoint foo "/foo(.*)")

  (def (foo/GET text)
    (http-response-write*
     400 [] (format "EP1!!:~a" text)))

  (define-endpoint epmux1  "/ep1(.*)")
  (def epmux1/GET foo/GET)

  (define-endpoint default-ep1 "(.*)"
      handler: (lambda (req res args)
                 (http-response-write
                  res 404 '(("Content-Type" . "text/plain"))
                  (format "Default Not Found: ~a" (car args))))
     priority: +inf.0)


  (with-httpd default-endpoint-http-mux
    (let ((r1 (test-http-get "/ep1"))
          (r2 (test-http-get "/foofoo"))
          (r3 (test-http-get "/nope"))
          (r4 (test-http-get "/foo")))
      (check (request-text r1) => "EP1!!:")
      (check (request-text r2) => "EP1!!:foo")
      (check (request-status r3) => 404)
      (check (request-text r4) => (request-text r1))))
#+end_src
#+begin_src gerbil  :tangle "endpoint.ss" :noweb yes :noweb-ref endpoint.ss
  (import :drewc/ftw/httpd/endpoint/struct
          :drewc/ftw/httpd/endpoint/queue
          :drewc/ftw/httpd/endpoint/mux
          (for-syntax  :drewc/ftw/httpd/endpoint/struct)
           :gerbil/expander)
  (export #t
   (import: :drewc/ftw/httpd/endpoint/queue)
   (import: :drewc/ftw/httpd/endpoint/struct)
   (import: :drewc/ftw/httpd/endpoint/mux))

   <<endpoints-code>>

#+end_src


* DONE Endpoint Mux
  CLOSED: [2020-01-12 Sun 13:06]
  :PROPERTIES:
  :header-args: :noweb-ref endpointmux
  :CUSTOM_ID: endpoint_mux
  :END:

To multiplex across an [[#struct_endpoint][Endpoint]] [[#endpoint_queue][Queue]] is very simple. The
~endpoint-queue-dispatch-function~ is provided by the queue. The queue sorting
is taken care of by the mux handler.


#+begin_src gerbil :tangle "endpoint/mux.ss"
  (import :drewc/ftw/httpd/endpoint/queue :std/net/httpd/mux :std/net/httpd
              :gerbil/gambit/exceptions :std/logger :clan/error)
  (export #t) 
  (defstruct endpoint-http-mux
    (queue sort-every reset-every handler error-handler 404-handler)
    constructor: :init!)

  (def (default-endpoint-error-handler err req res)
    (log-error
     (string-append "Endpoint Handler Error for" (http-request-path req)) err)
    (http-response-write
     res 500 '(("Content-Type" . "text/plain")) "Endpoint Handler Error"))

  (def (default-endpoint-404-handler req res)
    (http-response-write
     res 404 '(("Content-Type" . "text/plain"))
     "these aren't the droids you are looking for"))

  (def (endpoint-http-mux-dispatch-function
        mux
        (q (endpoint-http-mux-queue mux))
        (sort-every (endpoint-http-mux-sort-every mux))
        (reset-every (endpoint-http-mux-reset-every mux)))
    (let ((sc 0) (rc 0))
      (lambda (req res)
        (with-catch
         (lambda (e) (begin0 #t ((endpoint-http-mux-error-handler mux) e req res)))
         (lambda ()
           (if (not ((endpoint-queue-dispatch-function q) req res))
             (begin0 #t ((endpoint-http-mux-404-handler mux) req res))
             (begin0 #t
               (when (= sort-every sc)
                 (sort-endpoint-queue! q) (set! sc 0))
               (set! sc (1+ sc))
               (when (= reset-every rc)
                 (reset-endpoint-queue-hit-counter! q) (set! rc 0))
               (set! rc (1+ rc)))))))))

  (defmethod {:init! endpoint-http-mux}
    (lambda (self sort-every: (se 100) reset-every: (re 1000)
             queue: (q (endpoint-queue)))
      (struct-instance-init!
       self q se re
       (endpoint-http-mux-dispatch-function self q se re)
       default-endpoint-error-handler
       default-endpoint-404-handler)))

  (def (add-endpoint-to-mux! ep mux . queue-args)
    (apply add-endpoint-to-queue! ep (endpoint-http-mux-queue mux) queue-args))

  (def (remove-endpoint-from-mux! ep mux)
    (remove-endpoint-from-queue! ep (endpoint-http-mux-queue mux)))

  (defmethod {get-handler endpoint-http-mux}
    (lambda (self . _)
      (endpoint-http-mux-handler self)))

  (defmethod {put-handler! endpoint-http-mux}
    (lambda (mux host path handler)
      (error "Put handler unbound")))
#+end_src

** INPROGRESS Testing

 Toplevel.
 #+begin_src gerbil :noweb-ref test-endpointmux-toplevel
   (def epmux (endpoint '42 "/ep1(.*)"))
   (def (42/GET text)
     (http-response-write*
      400 [] (format "EP1!!:~a" text)))

 #+end_src

 #+begin_src gerbil :noweb-ref test-endpointmux
   (def emux (make-endpoint-http-mux))

   (add-endpoint-to-mux! epmux emux priority: 42)
   (def default-ep
     (endpoint
      'default "(.*)"
      handler: (lambda (req res args)
                 (http-response-write
                  res 404 '(("Content-Type" . "text/plain"))
                  (format "Default Not Found: ~a" (car args))))))



   (add-endpoint-to-mux! default-ep emux priority: +inf.0)

   (with-httpd emux
     (let ((r1 (test-http-get "/ep1"))
           (r2 (test-http-get "/ep1foo"))
           (r3 (test-http-get "/nope")))
       (check (request-text r1) => "EP1!!:")
       (check (request-text r2) => "EP1!!:foo")
       (check (request-status r3) => 404)))

 #+end_src

 
 
