ftw/httpd/endpoint.org
** Handling a matched request
re
If a request matches the predicate, it returns a list of arguments to be passed
to the handler. By default, a handler is a function, ~name/METHOD~.

 - GET :: The GET method requests a representation of the specified resource.
          Requests using GET should only retrieve data.
 - HEAD :: The HEAD method asks for a response identical to that of a GET
           request, but without the response body.
 - POST :: The POST method is used to submit an entity to the specified
           resource, often causing a change in state or side effects on the
           server.
 - PUT :: The PUT method replaces all current representations of the target
          resource with the request payload.
 - DELETE :: The DELETE method deletes the specified resource.
 - CONNECT :: The CONNECT method establishes a tunnel to the server identified
              by the target resource.

 - OPTIONS :: The OPTIONS method is used to describe the communication options
              for the target resource.
 - TRACE :: The TRACE method performs a message loop-back test along the path to
            the target resource.

 - PATCH :: The PATCH method is used to apply partial modifications to a
            resource.

#+begin_src gerbil
  (def (endpoint-name->handler name)
    (defsyntax (handler stx)
      (syntax-case stx  ()
        ((h meth)
         (let (M (syntax->datum #'meth))
           (datum->syntax #'h
             `(let (fn (or ,M
                           (parameterize ((gx#current-expander-context ctx))
                             (##eval
                              `(lambda (args)
                                 (apply ,(string->symbol (format "~a/~a" name ',M)) args))
                              ctx))))
                (begin0 (fn args)
                  (unless ,M (set! ,M fn)))))))
        ((h ms ...)
         (let* ((methods (syntax->datum #'(ms ...)))
                (lets (map (lambda (m) [m #f]) methods))
                (cases (map (lambda (m) [[m] `(handler ,m)]) methods)))
           (datum->syntax #'h
             `(let ,lets
                (lambda (req res args)
                  (let ((method (http-request-method req)))
                    ((ftw-handler (case method ,@cases))
                     req res)))))))))
    (let (ctx (gx#current-expander-context))
        (handler GET HEAD POST PUT DELETE CONNECT OPTIONS TRACE PATCH)))

#+end_src


** Testing 
   :PROPERTIES:
   :header-args: :noweb-ref test-endpoint-struct-toplevel
   :END:

We'll create an endpoint struct, and a ~GET~ handler for it. 

The ~match~ is a string and [[#endpoint_match][by default]] we match regexp groups. Our regexp does a
whole bunch of things just to have fun with the reasoning behind.

#+begin_src gerbil 
  (def test::endpoint (endpoint 'test "^/([^/]*)/?test/?(.*)"))
#+end_src
t
For our handler, simply format the args and return them as text

#+begin_src gerbil 
  (def (test/GET . args)
    (http-response-write* 200 '(("Content-Type" . "text/plain"))
                          (format "~a" args)))
#+end_src

The other way is to pass a function. Since we pass args to the handler, we can
then pass whatever we want.

#+begin_src gerbil
  (def (match-function? req)
    (and (string=? (http-request-path req) "/function")
         [(http-request-url req)]))

  (def match::endpoint (endpoint 'match match-function?))

  (def match/GET test/GET)
#+end_src

Now a simple handler to register with the existing mux.


#+begin_src gerbil 
  (def (test-endpoint-handler req res)
    (try 
     (or ((endpoint-dispatcher test::endpoint) req res)
         ((endpoint-dispatcher match::endpoint) req res)
         (default-handler req res))
     (catch (e) (http-response-write
                 res 500 '(("Content-Type" . "text/plain"))
                 (with-output-to-string (cut display-exception e))))))
#+end_src
Let's make sure it works! 

#+begin_src gerbil :noweb-ref test-endpoint-struct
  ;; (def httpd
  ;;   (start-http-server! server-address mux: (make-recursive-http-mux)))

  (http-register-handler httpd "" test-endpoint-handler)

  (let (req (test-http-get "/this-is-a/test"))
    (check (request-status req) => 200)
    (check (request-text req) => "(this-is-a )"))


    (let (req (test-http-get "/this-is-atest"))
      (check (request-status req) => 200)
      (check (request-text req) => "(this-is-a )"))

    (let (req (test-http-get "/this-is-a/test/request"))
      (check (request-status req) => 200)
      (check (request-text req) => "(this-is-a request)"))


    (let (req (test-http-get "/this-is-atestrequest"))
      (check (request-status req) => 200)
      (check (request-text req) => "(this-is-a request)"))

    (let (req (test-http-get "/function?bar=baz"))
      (check (request-status req) => 200)
      (check (request-text req) => "(/function?bar=baz)"))

  ;; (stop-http-server! httpd)


#+end_src

* INPROGRESS Testing 
  :PROPERTIES:
  :CUSTOM_ID: Testing
  :END:

#+begin_src gerbil :noweb yes :tangle "endpoint-test.ss" 
  (import :std/test  :std/sugar  :std/net/request :std/net/httpd 
              :drewc/ftw/httpd/handler :std/format :std/iter :std/srfi/95
              :drewc/ftw/httpd/endpoint/struct
              :drewc/ftw/httpd/endpoint/queue
              :drewc/ftw/httpd/endpoint/mux
              :gerbil/gambit/exceptions
              :gerbil/gambit/ports
              (only-in :gerbil/gambit/random random-integer))

  <<test-http-request>>

  (export endpoint-test)

  (def greeting-not-found "these aren't the droids you are looking for")

  (def (default-handler req res)
    (http-response-write
     res 404 '(("Content-Type" . "text/plain")) greeting-not-found))

  <<test-endpoint-struct-toplevel>>
  <<test-endpoint-queue-toplevel>>
  <<test-endpointmux-toplevel>>
  (def endpoint-test
    (test-suite
     "test :drewc/ftw/httpd/endpoint"


     (test-case
      "Endpoint Struct: basic dispatch"
      (with-httpd (make-recursive-http-mux)
        <<test-endpoint-struct>>))

     (test-case "Endpoint Queue"
      (with-httpd (make-recursive-http-mux)
                  <<test-endpoint-queue>>))

      (test-case "Endpoint Mux"
                 <<test-endpointmux>>)))











#+end_src



* Files 

** endpoint/struct.ss 

#+begin_src gerbil :tangle endpoint/struct.ss :noweb yes :comments noweb
  (import :std/net/httpd 
          :std/pregexp :gerbil/expander
          :std/sugar :std/format :std/srfi/95 :std/iter :std/error
         :drewc/ftw/httpd/handler)
  (export #t)

  <<endpoint-struct>>
#+end_src

** endpoint/queue.ss

#+begin_src gerbil :tangle "endpoint/queue.ss" :noweb yes
  ;;; (c) drewc <me@drewc.ca>

  (import :std/srfi/1 :std/srfi/95 :std/iter :drewc/ftw/httpd/endpoint/struct :std/sugar)
  (export #t)

  <<endpoint-q-code-tangled>>

#+end_src

#+begin_src gerbil  :noweb yes :comments noweb :noweb-ref endpoint-q-code-tangled
  <<endpoint-q-code>>
#+end_src

* HACKING 
#+begin_src gerbil
  (import :drewc/ftw/httpd/endpoint/mux)

#+end_src
