src/httpd/endpoint/struct.ss
;; [[file:~/src/ftw/src/httpd/endpoint.org::*Handling%20a%20matched%20request][]]
(def (endpoint-name->handler name)
  (defsyntax (handler stx)
    (syntax-case stx  ()
      ((h meth)
       (let (M (syntax->datum #'meth))
         (datum->syntax #'h
           `(let (fn (or ,M
                         (parameterize ((gx#current-expander-context ctx))
                           (##eval
                            `(lambda (args)
                               (apply ,(string->symbol (format "~a/~a" name ',M)) args))
                            ctx))))
              (begin0 (fn args)
                (unless ,M (set! ,M fn)))))))
      ((h ms ...)
       (let* ((methods (syntax->datum #'(ms ...)))
              (lets (map (lambda (m) [m #f]) methods))
              (cases (map (lambda (m) [[m] `(handler ,m)]) methods)))
         (datum->syntax #'h
           `(let ,lets
              (lambda (req res args)
                (let ((method (http-request-method req)))
                  ((ftw-handler (case method ,@cases))
                   req res)))))))))
  (let (ctx (gx#current-expander-context))
      (handler GET HEAD POST PUT DELETE CONNECT OPTIONS TRACE PATCH)))

;; ends here
;; endpoint/struct.ss:1 ends here
